Repository: zziri/cmux
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: ar, bs, da, de, es, fr, it, ja, ko, nb, pl, pt_br, ru, th, tr, uk, zh_hans, zh_hant

# settings.mobile.pairDevice.subtitle
source: Devices signed in to the same account connect automatically. Use this QR only to pair through Tailscale.
ar: تتصل الأجهزة التي سجلت الدخول إلى الحساب نفسه تلقائيًا. استخدم رمز QR هذا فقط للاقتران عبر Tailscale.
de: Mit demselben Konto angemeldete Geräte verbinden sich automatisch. Verwenden Sie diesen QR-Code nur, um die Kopplung über Tailscale durchzuführen.
es: Los dispositivos con la sesión iniciada en la misma cuenta se conectan automáticamente. Use este QR solo para emparejar a través de Tailscale.
fr: Les appareils connectés au même compte se connectent automatiquement. Utilisez ce code QR uniquement pour un jumelage via Tailscale.
ja: 同じアカウントでサインインしているデバイスは自動的に接続されます。このQRはTailscale経由のペアリングにのみ使用します。
ko: 동일한 계정에 로그인한 기기는 자동으로 연결됩니다. Tailscale을 통해 페어링하는 경우에만 이 QR을 사용하세요.
zh_hans: 登录同一账户的设备会自动连接。此二维码仅用于通过 Tailscale 配对。
zh_hant: 登入相同帳戶的裝置會自動連線。僅在使用 Tailscale 配對時才使用此 QR 碼。

# settings.mobile.phonePush.forwarding
source: Forward Notifications to iPhone
ar: توجيه الإشعارات إلى iPhone
de: Benachrichtigungen an das iPhone weiterleiten
es: Reenviar notificaciones al iPhone
fr: Transférer les notifications vers l’iPhone
ja: iPhone に通知を転送
ko: iPhone으로 알림 전달
zh_hans: 将通知转发到 iPhone
zh_hant: 轉寄通知至 iPhone

# settings.mobile.phonePush.forwarding.subtitleOff
source: Stops this Mac from sending local agent alerts to mobile devices.
ar: يمنع جهاز Mac هذا من إرسال تنبيهات الوكيل المحلي إلى الأجهزة المحمولة.
de: Verhindert, dass dieser Mac lokale Agenten-Warnungen an Mobilgeräte sendet.
es: Evita que esta Mac envíe alertas de agentes locales a dispositivos móviles.
fr: Empêche ce Mac d’envoyer des alertes d’agent local aux appareils mobiles.
ja: この Mac からモバイルデバイスへのローカルエージェント通知の送信を停止します。
ko: 이 Mac에서 모바일 기기로 로컬 에이전트 경고를 보내지 않도록 설정합니다.
zh_hans: 让这台 Mac 不再把本机的代理提醒发送到移动设备。
zh_hant: 停止由此 Mac 傳送本地代理程式警示至行動裝置。

# settings.mobile.phonePush.forwarding.subtitleOn
source: Sends local agent alerts from this Mac to cmux on your iPhone and iPad.
ar: يرسل تنبيهات الوكيل المحلي من جهاز Mac هذا إلى cmux على جهاز iPhone وiPad الخاص بك.
de: Sendet lokale Agenten-Warnungen von diesem Mac an cmux auf Ihrem iPhone und iPad.
es: Envía alertas de agentes locales desde esta Mac a cmux en tu iPhone y iPad.
fr: Envoie les alertes d’agent local de ce Mac vers cmux sur votre iPhone et iPad.
ja: この Mac のローカルエージェント通知を iPhone や iPad の cmux に送信します。
ko: 이 Mac의 로컬 에이전트 경고를 iPhone 및 iPad의 cmux로 보냅니다.
zh_hans: 把这台 Mac 上的本机代理提醒发送到你 iPhone 和 iPad 上的 cmux。
zh_hant: 自此 Mac 傳送本地代理程式警示至您 iPhone 和 iPad 上的 cmux。

# settings.mobile.phonePush.hideContent
source: Hide Notification Content
ar: إخفاء محتوى الإشعارات
de: Benachrichtigungsinhalt ausblenden
es: Ocultar contenido de notificación
fr: Masquer le contenu des notifications
ja: 通知内容を非表示
ko: 알림 내용 숨기기
zh_hans: 隐藏通知内容
zh_hant: 隱藏通知內容

# settings.mobile.phonePush.hideContent.subtitle
source: Sends a generic message instead of agent and terminal text.
ar: يرسل رسالة عامة بدلاً من نص الوكيل ونص الطرفية.
de: Sendet eine allgemeine Nachricht anstelle von Agenten- und Terminaltext.
es: Envía un mensaje genérico en lugar de texto del agente y de la terminal.
fr: Envoie un message générique au lieu du texte de l’agent et du terminal.
ja: エージェントやターミナルのテキストの代わりに一般的なメッセージを送信します。
ko: 에이전트 및 터미널 텍스트 대신 일반 메시지를 보냅니다.
zh_hans: 发送一条通用消息，而不是代理与终端的文本内容。
zh_hant: 傳送一般訊息，而非代理程式和終端機文字。

# settings.mobile.phonePush.mode
source: When to Send
ar: وقت الإرسال
de: Wann gesendet werden soll
es: Cuándo enviar
fr: Quand envoyer
ja: 送信するタイミング
ko: 전송 시기
zh_hans: 何时发送
zh_hant: 傳送時機

# settings.mobile.phonePush.mode.always
source: Always
ar: دائماً
de: Stets
es: Siempre
fr: Toujours
ja: 常に
ko: 언제나
zh_hans: 始终
zh_hant: 總是

# settings.mobile.phonePush.mode.onlyWhenAway
source: Only When Away
ar: فقط عندما تكون بعيدا
de: Nur wenn weg
es: Sólo cuando estás lejos
fr: Seulement en mon absence
ja: 離席中のみ
ko: 자리를 비울 때만
zh_hans: 仅在离开时
zh_hant: 僅當離開時

# settings.mobile.phonePush.mode.subtitle
source: Always sends every local agent alert. Away mode waits until this Mac is locked, asleep, or idle.
ar: يرسل دائمًا كل تنبيه من الوكيل المحلي. ينتظر وضع "الابتعاد" (Away) حتى يتم قفل جهاز Mac هذا أو نومه أو خموله.
de: Sendet immer jede lokale Agenten-Warnung. Der Abwesenheitsmodus wartet, bis dieser Mac gesperrt ist, sich im Ruhezustand befindet oder inaktiv ist.
es: Envía siempre todas las alertas de agentes locales. El modo ausente espera hasta que esta Mac esté bloqueada, en reposo o inactiva.
fr: Envoie toujours chaque alerte d’agent local. Le mode Absence attend que ce Mac soit verrouillé, en veille ou inactif.
ja: 「常に」はすべてのローカルエージェント通知を送信します。「離席中」は、この Mac がロック中、スリープ中、またはアイドル状態になるまで待機します。
ko: 항상 모든 로컬 에이전트 경고를 보냅니다. 자리 비움 모드에서는 이 Mac이 잠기거나 잠자기 상태이거나 대기 상태가 될 때까지 대기합니다.
zh_hans: 「始终」会发送每一条本机代理提醒。「离开」模式会等到这台 Mac 锁定、睡眠或闲置时再发送。
zh_hant: 「總是」會傳送每個本地代理程式警示。「離開」模式則會等到此 Mac 鎖定、睡眠或閒置時才傳送。

# settings.mobile.port
source: Pairing Port
ar: منفذ الاقتران
de: Kopplungs-Port
es: Puerto de vinculación
fr: Port de jumelage
ja: ペアリングポート
ko: 페어링 포트
zh_hans: 配对端口
zh_hant: 配對連接埠

# settings.mobile.port.apply
source: Apply
ar: تطبيق
de: Anwenden
es: Aplicar
fr: Appliquer
ja: 適用
ko: 적용
zh_hans: 应用
zh_hant: 套用

# settings.mobile.port.apply.inUse
source: Port %lld is in use. The pairing listener is still on %lld.
ar: المنفذ %lld قيد الاستخدام. لا يزال مستمع الاقتران يعمل على %lld.
de: Port %lld wird bereits verwendet. Der Kopplungs-Listener läuft weiterhin auf %lld.
es: El puerto %lld está en uso. El receptor de vinculación sigue en %lld.
fr: Le port %lld est en cours d’utilisation. L’écouteur de jumelage est toujours sur %lld.
ja: ポート %lld は使用中です。ペアリングリスナーは引き続きポート %lld で待ち受けています。
ko: %lld 포트가 사용 중입니다. 페어링 리스너는 여전히 %lld에 있습니다.
zh_hans: 端口 %lld 已被占用。配对监听器仍在 %lld 上。
zh_hant: 連接埠 %lld 正在使用中。配對接聽程式仍位於 %lld。

# settings.mobile.port.apply.saved
source: Saved. The pairing listener will use port %lld when iOS Pairing is on.
ar: تم الحفظ. سيستخدم مستمع الاقتران المنفذ %lld عندما يكون اقتران iOS قيد التشغيل.
de: Gespeichert. Der Kopplungs-Listener verwendet Port %lld, wenn die iOS-Kopplung aktiviert ist.
es: Guardado. El receptor de vinculación usará el puerto %lld cuando la vinculación con iOS esté activada.
fr: Enregistré. L’écouteur de jumelage utilisera le port %lld lorsque le jumelage iOS sera activé.
ja: 保存しました。iOS ペアリングを有効にするとペアリングリスナーはポート %lld を使用します。
ko: 저장되었습니다. iOS 페어링이 활성화되면 페어링 리스너가 %lld 포트를 사용합니다.
zh_hans: 已保存。开启 iOS 配对后，配对监听器将使用端口 %lld。
zh_hant: 已儲存。啟用 iOS 配對時，配對接聽程式將會使用連接埠 %lld。

# settings.mobile.port.note
source: Click Apply to change the port. cmux checks the port is free first: if it's in use, the current listener keeps running untouched; if it's free, the pairing listener rebinds now and connected devices reconnect. The Iroh endpoint adopts the new port the next time cmux starts.
ar: انقر على "تطبيق" لتغيير المنفذ. يتحقق cmux أولاً من أن المنفذ فارغ: إذا كان قيد الاستخدام، يستمر المستمع الحالي في العمل دون تغيير؛ وإذا كان فارغًا، يعيد مستمع الاقتران الارتباط الآن وتتصل الأجهزة المتصلة مجددًا. تتبنى نقطة نهاية Iroh المنفذ الجديد في المرة التالية التي يبدأ فيها تشغيل cmux.
de: Klicken Sie auf „Anwenden“, um den Port zu ändern. cmux prüft zuerst, ob der Port frei ist: Wenn er belegt ist, läuft der aktuelle Listener unverändert weiter; wenn er frei ist, bindet sich der Kopplungs-Listener jetzt neu und verbundene Geräte verbinden sich wieder. Der Iroh-Endpunkt übernimmt den neuen Port beim nächsten Start von cmux.
es: Haz clic en Aplicar para cambiar el puerto. cmux comprueba primero si el puerto está libre: si está en uso, el receptor actual sigue funcionando sin cambios; si está libre, el receptor de vinculación se vuelve a enlazar ahora y los dispositivos conectados se vuelven a conectar. El punto de conexión de Iroh adoptará el nuevo puerto la próxima vez que se inicie cmux.
fr: Cliquez sur Appliquer pour changer le port. cmux vérifie d’abord que le port est libre : s’il est utilisé, l’écouteur actuel continue de fonctionner sans modification ; s’il est libre, l’écouteur de jumelage se relie immédiatement et les appareils connectés se reconnectent. Le point de terminaison Iroh adoptera le nouveau port au prochain démarrage de cmux.
ja: ポートを変更するには「適用」をクリックします。cmux はまずポートが空いているか確認します。使用中の場合は現在のリスナーをそのまま維持し、空いている場合はペアリングリスナーを直ちに再バインドして、接続中のデバイスは新しいポートで再接続します。Iroh エンドポイントは次回の cmux 起動時に新しいポートを使用します。
ko: 포트를 변경하려면 적용을 클릭하세요. cmux는 먼저 포트가 비어 있는지 확인합니다. 사용 중인 경우 현재 리스너가 변경 없이 계속 실행되고, 비어 있는 경우 페어링 리스너가 지금 다시 바인딩되며 연결된 기기가 다시 연결됩니다. Iroh 엔드포인트는 다음 번에 cmux가 시작될 때 새 포트를 적용합니다.
zh_hans: 点按「应用」以更改端口。cmux 会先检查端口是否空闲：若已被占用，当前监听器保持原样继续运行；若空闲，配对监听器会立即重新绑定，已连接的设备会重新连接。Iroh 端点会在 cmux 下次启动时采用新端口。
zh_hant: 按一下套用以變更連接埠。cmux 會先檢查該連接埠是否可用：若已被佔用，目前的接聽程式將繼續執行且不受影響；若為可用，配對接聽程式會立即重新繫結，且已連線的裝置將會重新連線。Iroh 端點將在下次 cmux 啟動時採用新的連接埠。

# settings.mobile.port.status.fallback
source: Port %lld is in use. The pairing listener is on %lld instead.
ar: المنفذ %lld قيد الاستخدام. مستمع الاقتران يعمل على %lld بدلاً من ذلك.
de: Port %lld wird bereits verwendet. Der Kopplungs-Listener läuft stattdessen auf %lld.
es: El puerto %lld está en uso. El receptor de vinculación está en %lld en su lugar.
fr: Le port %lld est en cours d’utilisation. L’écouteur de jumelage est sur %lld à la place.
ja: ポート %lld は使用中です。ペアリングリスナーは代わりにポート %lld で待ち受けています。
ko: %lld 포트가 사용 중입니다. 페어링 리스너가 대신 %lld에 있습니다.
zh_hans: 端口 %lld 已被占用。配对监听器改用 %lld。
zh_hant: 連接埠 %lld 已被佔用。配對接聽程式改為使用 %lld。

# settings.mobile.port.status.invalid
source: Port must be between 1 and 65535.
ar: يجب أن يكون المنفذ بين 1 و65535.
de: Der Port muss zwischen 1 und 65535 liegen.
es: El puerto debe estar entre 1 y 65535.
fr: Le port doit être compris entre 1 et 65535.
ja: ポートは 1〜65535 の範囲で指定してください。
ko: 포트는 1에서 65535 사이여야 합니다.
zh_hans: 端口必须介于 1 和 65535 之间。
zh_hant: 連接埠必須介於 1 到 65535 之間。

# settings.mobile.port.status.ok
source: Pairing listener on port %lld.
ar: مستمع الاقتران يعمل على المنفذ %lld.
de: Kopplungs-Listener auf Port %lld.
es: Receptor de vinculación en el puerto %lld.
fr: Écouteur de jumelage sur le port %lld.
ja: ペアリングリスナーはポート %lld で待ち受けています。
ko: %lld 포트에서 페어링 리스너가 실행 중입니다.
zh_hans: 配对监听器在端口 %lld 上。
zh_hant: 配對接聽程式正於連接埠 %lld 運作。

# settings.mobile.port.status.starting
source: Starting the pairing listener…
ar: جاري بدء مستمع الاقتران…
de: Kopplungs-Listener wird gestartet…
es: Iniciando el receptor de vinculación…
fr: Démarrage de l’écouteur de jumelage…
ja: ペアリングリスナーを開始しています…
ko: 페어링 리스너 시작 중…
zh_hans: 正在启动配对监听…
zh_hant: 正在啟動配對接聽程式…

# settings.mobile.port.subtitle
source: Preferred port for the iOS pairing listener (TCP) and the Iroh endpoint that Direct addresses dial (UDP), 1–65535.
ar: المنفذ المفضل لمستمع اقتران iOS ‏(TCP) ونقطة نهاية Iroh التي تطلبها العناوين المباشرة (UDP)، من 1 إلى 65535.
de: Bevorzugter Port für den iOS-Kopplungs-Listener (TCP) und den Iroh-Endpunkt, den Direkt-Adressen anwählen (UDP), 1–65535.
es: Puerto preferido para el receptor de vinculación de iOS (TCP) y el punto de conexión de Iroh al que llaman las direcciones directas (UDP), de 1 a 65535.
fr: Port préféré pour l’écouteur de jumelage iOS (TCP) et le point de terminaison Iroh composé par les adresses directes (UDP), 1–65535.
ja: iOS ペアリングリスナー（TCP）と、Direct アドレスの接続先となる Iroh エンドポイント（UDP）の優先ポート（1〜65535）。
ko: iOS 페어링 리스너(TCP) 및 직접 주소가 연결하는 Iroh 엔드포인트(UDP)가 선호하는 포트(1~65535)입니다.
zh_hans: iOS 配对监听器（TCP）以及 Direct 地址所拨的 Iroh 端点（UDP）首选的端口，取值 1–65535。
zh_hant: iOS 配對接聽程式 (TCP) 以及直接地址撥號之 Iroh 端點 (UDP) 的偏好連接埠，範圍為 1–65535。

# settings.mobile.route.iroh
source: Iroh
ar: إيروه
ko: 이로
zh_hans: 伊罗
zh_hant: 伊羅

# settings.mobile.route.loopback
source: Loopback
ar: الاسترجاع
es: Bucle invertido
fr: Bouclage
ja: ループバック
ko: 루프백
zh_hans: 回环
zh_hant: 環回

# settings.mobile.routes.empty
source: No reachable addresses yet. Iroh routes need this Mac signed in to your cmux account; Tailscale routes need Tailscale running on this Mac.
ar: لا توجد عناوين يمكن الوصول إليها بعد. تحتاج مسارات Iroh إلى تسجيل دخول جهاز Mac هذا إلى حساب cmux الخاص بك؛ وتحتاج مسارات Tailscale إلى تشغيل Tailscale على جهاز Mac هذا.
de: Noch keine erreichbaren Adressen. Iroh-Routen erfordern, dass dieser Mac bei Ihrem cmux-Konto angemeldet ist; Tailscale-Routen erfordern, dass Tailscale auf diesem Mac läuft.
es: Aún no hay direcciones accesibles. Las rutas de Iroh necesitan que esta Mac haya iniciado sesión en tu cuenta de cmux; las rutas de Tailscale necesitan que Tailscale esté ejecutándose en esta Mac.
fr: Aucune adresse accessible pour le moment. Les routes Iroh nécessitent que ce Mac soit connecté à votre compte cmux ; les routes Tailscale nécessitent que Tailscale soit en cours d’exécution sur ce Mac.
ja: 到達可能なアドレスがまだありません。Iroh 経路にはこの Mac が cmux アカウントにサインインしていることが、Tailscale 経路にはこの Mac で Tailscale が動作していることが必要です。
ko: 아직 도달 가능한 주소가 없습니다. Iroh 경로에는 이 Mac이 사용자의 cmux 계정에 로그인되어 있어야 하며, Tailscale 경로에는 이 Mac에서 Tailscale이 실행 중이어야 합니다.
zh_hans: 暂无可达地址。Iroh 路由需要这台 Mac 登录你的 cmux 账户；Tailscale 路由需要这台 Mac 上运行 Tailscale。
zh_hant: 目前尚無可連線的地址。Iroh 路由需要此 Mac 登入您的 cmux 帳戶；Tailscale 路由則需要在此 Mac 上執行 Tailscale。

# settings.mobile.routes.title
source: Reachable at
ar: يمكن الوصول إليه على
de: Erreichbar unter
es: Accesible en
fr: Accessible à
ja: 接続先
ko: 연결 가능 주소
zh_hans: 可达地址
zh_hant: 可連線於

# settings.networking.attention
source: Your saved relay choice needs attention. Direct Iroh remains available, but cmux will not substitute an unselected relay.
ar: خيار الترحيل المحفوظ الخاص بك يتطلب الاهتمام. يظل Direct Iroh متاحًا، ولكن لن يستبدل cmux مرحلاً غير محدد.
de: Ihre gespeicherte Relay-Auswahl erfordert Aufmerksamkeit. Direktes Iroh bleibt verfügbar, aber cmux wird kein nicht ausgewähltes Relay ersetzen.
es: Tu opción de retransmisión guardada requiere atención. El canal directo de Iroh sigue estando disponible, pero cmux no sustituirá una retransmisión no seleccionada.
fr: Votre choix de relais enregistré requiert votre attention. Direct Iroh reste disponible, mais cmux ne substituera pas un relais non sélectionné.
ja: 保存したリレーの選択を確認してください。Iroh の直接接続は利用できますが、cmux が未選択のリレーへ切り替えることはありません。
ko: 저장된 릴레이 선택 사항에 주의가 필요합니다. 직접 Iroh는 계속 사용할 수 있지만, cmux는 선택되지 않은 릴레이로 대체하지 않습니다.
zh_hans: 已保存的中继选择需要处理。直连 Iroh 仍然可用，但 cmux 不会替换为未选择的中继。
zh_hant: 您儲存的中繼選擇需要注意。直接 Iroh 連線仍可使用，但 cmux 不會自動替換為未選擇的中繼。

# settings.networking.check.action.account
source: Confirm you are signed in, then reopen cmux and run the check again.
ar: تأكد من تسجيل الدخول، ثم أعد فتح cmux وقم بتشغيل التحقق مرة أخرى.
de: Bestätigen Sie, dass Sie angemeldet sind, öffnen Sie dann cmux erneut und führen Sie die Prüfung erneut durch.
es: Confirme que ha iniciado sesión, luego vuelva a abrir cmux y ejecute la verificación nuevamente.
fr: Confirmez que vous êtes connecté, puis rouvrez cmux et réexécutez la vérification.
ja: サインインを確認し、cmux を開き直してからもう一度確認してください。
ko: 로그인되었는지 확인한 다음 cmux를 다시 열고 확인을 다시 실행하세요.
zh_hans: 请确认你已登录，然后重新打开 cmux 并再次运行检查。
zh_hant: 確認您已登錄，然後重新開啟 cmux 並再次執行檢查。

# settings.networking.check.action.internet
source: Connect this Mac to the internet, then run the check again.
ar: قم بتوصيل جهاز Mac هذا بالإنترنت، ثم قم بإجراء الفحص مرة أخرى.
de: Verbinden Sie diesen Mac mit dem Internet und führen Sie die Prüfung erneut durch.
es: Conecta esta Mac a internet y luego vuelve a realizar la comprobación.
fr: Connectez ce Mac à Internet, puis relancez la vérification.
ja: この Mac をインターネットに接続してから、もう一度確認してください。
ko: 이 Mac을 인터넷에 연결한 후 검사를 다시 실행하세요.
zh_hans: 请让这台 Mac 连上互联网，然后再次运行检查。
zh_hant: 將此 Mac 連線至網際網路，然後重新執行檢查。

# settings.networking.check.action.mac
source: Keep cmux open and confirm both apps use the same account.
ar: أبقِ cmux مفتوحًا وتأكد من أن كلا التطبيقين يستخدمان الحساب نفسه.
de: Lassen Sie cmux geöffnet und bestätigen Sie, dass beide Apps dasselbe Konto verwenden.
es: Mantén cmux abierto y confirma que ambas aplicaciones usen la misma cuenta.
fr: Gardez cmux ouvert et vérifiez que les deux applications utilisent le même compte.
ja: cmux を開いたままにし、両方のアプリが同じアカウントを使用していることを確認してください。
ko: cmux를 열어두고 두 앱이 동일한 계정을 사용하는지 확인하세요.
zh_hans: 请保持 cmux 打开，并确认两个应用使用同一个账户。
zh_hant: 保持 cmux 開啟，並確認兩個應用程式皆使用同一個帳戶。

# settings.networking.check.action.relay
source: Your network may block relay traffic. Ask IT to allow HTTPS and WebSocket access to your configured cmux relay domains, or add an approved custom relay.
ar: قد تقوم شبكتك بحظر حركة مرور الترحيل. اطلب من قسم تكنولوجيا المعلومات السماح بوصول HTTPS وWebSocket إلى مجالات ترحيل cmux التي تم تكوينها، أو إضافة ترحيل مخصص معتمد.
de: Ihr Netzwerk blockiert möglicherweise den Relay-Verkehr. Bitten Sie die IT, HTTPS- und WebSocket-Zugriff auf Ihre konfigurierten cmux-Relay-Domänen zuzulassen, oder fügen Sie ein genehmigtes benutzerdefiniertes Relay hinzu.
es: Su red puede bloquear el tráfico de retransmisión. Pídale a TI que permita el acceso HTTPS y WebSocket a sus dominios de retransmisión cmux configurados, o agregue una retransmisión personalizada aprobada.
fr: Votre réseau peut bloquer le trafic de relais. Demandez au service informatique d'autoriser l'accès HTTPS et WebSocket à vos domaines de relais cmux configurés, ou ajoutez un relais personnalisé approuvé.
ja: ネットワークがリレートラフィックを遮断している可能性があります。設定済みの cmux リレードメインへの HTTPS と WebSocket アクセスを許可するよう IT 部門に依頼するか、承認済みのカスタムリレーを追加してください。
ko: 네트워크에서 릴레이 트래픽을 차단할 수 있습니다. 구성된 cmux 릴레이 도메인에 대한 HTTPS 및 WebSocket 액세스를 허용하도록 IT에 요청하거나 승인된 사용자 지정 릴레이를 추가하세요.
zh_hans: 你的网络可能拦截了中继流量。请让 IT 放行到你所配置的 cmux 中继域名的 HTTPS 与 WebSocket 访问，或添加一个已批准的自定义中继。
zh_hant: 您的網路可能會阻止中繼流量。請求 IT 允許 HTTPS 和 WebSocket 存取您配置的 cmux 中繼域，或新增經批准的自訂中繼。

# settings.networking.check.action.repair
source: Update cmux on both devices. If needed, pair them again.
ar: قم بتحديث cmux على كلا الجهازين. وإذا لزم الأمر، قم باقترانهما مجددًا.
de: Aktualisieren Sie cmux auf beiden Geräten. Koppeln Sie sie bei Bedarf erneut.
es: Actualiza cmux en ambos dispositivos. Si es necesario, vuelve a vincularlos.
fr: Mettez à jour cmux sur les deux appareils. Si nécessaire, jumelez-les à nouveau.
ja: 両方のデバイスで cmux を更新してください。必要に応じて再度ペアリングしてください。
ko: 양쪽 기기 모두에서 cmux를 업데이트하세요. 필요한 경우 다시 페어링하세요.
zh_hans: 请在两台设备上都更新 cmux。必要时重新配对。
zh_hant: 更新兩部裝置上的 cmux。如有需要，請重新配對。

# settings.networking.check.action.retry
source: Retry. If this continues, share the safe report with cmux support.
ar: أعد المحاولة. إذا استمر هذا الأمر، قم بمشاركة التقرير الآمن مع دعم cmux.
de: Wiederholen. Wenn dies weiterhin der Fall ist, teilen Sie den sicheren Bericht mit dem cmux-Support.
es: Rever. Si esto continúa, comparta el informe seguro con el soporte de cmux.
fr: Réessayez. Si cela continue, partagez le rapport sécurisé avec le support cmux.
ja: 再試行してください。問題が続く場合は、安全なレポートを cmux サポートと共有してください。
ko: 다시 해 보다. 이 문제가 계속되면 cmux 지원팀과 안전 보고서를 공유하세요.
zh_hans: 请重试。若问题持续，请把安全报告发给 cmux 支持团队。
zh_hant: 重試。如果這種情況持續存在，請與 cmux 支援人員共用安全性報告。

# settings.networking.check.action.settings
source: Choose Automatic relay selection, or fix the selected custom relay and its device secret.
ar: اختر تحديد التتابع التلقائي، أو أصلح المرحل المخصص المحدد وسر الجهاز الخاص به.
de: Wählen Sie „Automatische Relay-Auswahl“ oder korrigieren Sie das ausgewählte benutzerdefinierte Relay und sein Gerätegeheimnis.
es: Elija Selección automática de relé o corrija el relé personalizado seleccionado y su secreto de dispositivo.
fr: Choisissez Sélection automatique du relais ou corrigez le relais personnalisé sélectionné et son secret de périphérique.
ja: リレー選択を「自動」にするか、選択したカスタムリレーとデバイスシークレットを修正してください。
ko: 자동 릴레이 선택을 선택하거나 선택한 사용자 지정 릴레이 및 해당 장치 비밀을 수정합니다.
zh_hans: 请选择「自动选择中继」，或修正所选的自定义中继及其设备密钥。
zh_hant: 選擇自動繼電器選擇，或修復選定的自訂繼電器及其設備密碼。

# settings.networking.check.allowlist.header
source: Allow outbound HTTPS and WebSocket access to these cmux relay origins:
ar: السماح بالوصول إلى HTTPS وWebSocket الصادر إلى أصول ترحيل cmux هذه:
de: Erlauben Sie ausgehenden HTTPS- und WebSocket-Zugriff auf diese cmux-Relay-Ursprünge:
es: Permita el acceso saliente HTTPS y WebSocket a estos orígenes de retransmisión cmux:
fr: Autoriser l'accès HTTPS et WebSocket sortant à ces origines de relais cmux :
ja: 次の cmux リレーオリジンへの送信 HTTPS および WebSocket アクセスを許可してください:
ko: 다음 cmux 릴레이 원본에 대한 아웃바운드 HTTPS 및 WebSocket 액세스를 허용합니다.
zh_hans: 请放行到这些 cmux 中继源的出站 HTTPS 与 WebSocket 访问：
zh_hant: 允許對這些 cmux 中繼來源的出站 HTTPS 和 WebSocket 存取：

# settings.networking.check.failed
source: Failed
ar: فشل
de: Fehlgeschlagen
es: Fallido
fr: Échoué
ja: 失敗
ko: 실패한
zh_hans: 未通过
zh_hant: 失敗的

# settings.networking.check.mac
source: Mac Available
ar: ماك متاح
de: Mac verfügbar
es: Mac disponible
fr: Mac disponible
ja: Mac の利用可否
ko: 맥 사용 가능
zh_hans: Mac 可用性
zh_hant: Mac 可用

# settings.networking.check.notApplicable
source: Not Needed
ar: ليست هناك حاجة
de: Nicht erforderlich
es: No es necesario
fr: Pas nécessaire
ja: 不要
ko: 필요하지 않음
zh_hans: 无需检查
zh_hant: 不需要

# settings.networking.check.note
source: cmux automatically uses direct internet, LAN, or any VPN route available to macOS, then falls back to an allowed relay. Every route remains end-to-end encrypted.
ar: يستخدم cmux تلقائيًا الإنترنت المباشر أو الشبكة المحلية (LAN) أو أي مسار VPN متاح لنظام macOS، ثم يتراجع إلى مرحل مسموح به. يظل كل مسار مشفرًا بالكامل من البداية إلى النهاية.
de: cmux verwendet automatisch direktes Internet, LAN, oder jede für macOS verfügbare VPN-Route und weicht dann auf ein zugelassenes Relay aus. Jede Route bleibt Ende-zu-Ende verschlüsselt.
es: cmux utiliza automáticamente internet directa, LAN o cualquier ruta VPN disponible para macOS, y luego recurre a una retransmisión permitida. Cada ruta permanece cifrada de extremo a extremo.
fr: cmux utilise automatiquement une connexion Internet directe, un réseau local ou toute route VPN disponible pour macOS, puis se rabat sur un relais autorisé. Chaque route reste chiffrée de bout en bout.
ja: cmux は macOS で利用可能なインターネット、LAN、または任意の VPN 経路を自動的に使用し、必要に応じて許可されたリレーへ切り替えます。すべての経路でエンドツーエンド暗号化が維持されます。
ko: cmux는 자동으로 macOS에서 사용 가능한 직접 인터넷, LAN 또는 임의의 VPN 경로를 사용한 후 허용된 릴레이로 대체 적용합니다. 모든 경로는 종단간 암호화 상태를 유지합니다.
zh_hans: cmux 会自动使用 macOS 可用的直连、局域网或任意 VPN 路由，再回退到已放行的中继。所有路由都保持端到端加密。
zh_hant: cmux 會自動使用 macOS 可用的直接網際網路、區域網路 (LAN) 或任何 VPN 路由，接著在無法連線時改用允許的中繼。所有路由皆維持端到端加密。

# settings.networking.check.passed
source: Passed
ar: اجتاز
de: Bestanden
es: Aprobado
fr: Passé
ja: 正常
ko: 합격
zh_hans: 已通过
zh_hant: 透過

# settings.networking.check.path
source: Active Route
ar: الطريق النشط
de: Aktive Route
es: Ruta activa
fr: Itinéraire actif
ja: アクティブな経路
ko: 활성 경로
zh_hans: 当前路由
zh_hant: 活動路線

# settings.networking.check.path.customRelay
source: Custom Relay (%1$@)
ar: التتابع المخصص (%1$@)
de: Benutzerdefiniertes Relay (%1$@)
es: Relé personalizado (%1$@)
fr: Relais personnalisé (%1$@)
ja: カスタムリレー（%1$@）
ko: 맞춤형 릴레이(%1$@)
zh_hans: 自定义中继（%1$@）
zh_hant: 自訂繼電器 (%1$@)

# settings.networking.check.path.direct
source: Direct Peer-to-Peer
ar: المباشر من نظير إلى نظير
de: Direktes Peer-to-Peer
es: Punto a punto directo
ja: ピアツーピア直接接続
ko: 직접 피어 투 피어
zh_hans: 点对点直连
zh_hant: 直接點對點

# settings.networking.check.path.managedRelay
source: cmux Relay (%1$@, %2$@)
ar: تتابع cmux (%1$@، %2$@)
es: Relé cmux (%1$@, %2$@)
fr: Relais cmux (%1$@, %2$@)
ja: cmux リレー（%1$@、%2$@）
ko: cmux 릴레이(%1$@, %2$@)
zh_hans: cmux 中继（%1$@，%2$@）
zh_hant: cmux 繼電器（%1$@、%2$@）

# settings.networking.check.path.private
source: LAN or Private VPN
ar: شبكة LAN أو شبكة VPN خاصة
de: LAN oder privates VPN
es: LAN o VPN privada
fr: LAN ou VPN privé
ja: LAN またはプライベート VPN
ko: LAN 또는 개인 VPN
zh_hans: 局域网或私有 VPN
zh_hant: LAN 或專用 VPN

# settings.networking.check.path.unavailable
source: No Live Route
ar: لا يوجد طريق مباشر
de: Keine Live-Route
es: Sin ruta activa
fr: Pas d'itinéraire en direct
ja: 有効な経路なし
ko: 실시간 경로 없음
zh_hans: 没有可用路由
zh_hant: 無即時路線

# settings.networking.check.policy
source: Relay Policy
ar: سياسة الترحيل
de: Relay-Richtlinie
es: Política de retransmisión
fr: Politique de relais
ja: リレーポリシー
ko: 릴레이 정책
zh_hans: 中继策略
zh_hant: 中繼政策
